tap 'homebrew/bundle'

brew 'colordiff'
brew 'figlet'
brew 'fortune'
brew 'git'
brew 'hub'
brew 'python'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'reattach-to-user-namespace'
brew 'shellcheck'

tap 'caskroom/cask'
brew 'brew-cask'
cask '1password'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'clipmenu'
cask 'dropbox'
cast
'evernote' cask 'firefox'
cask 'freeman'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'karabiner'
cask 'kobito'
cask 'macvim'
cask 'pocket'
cask 'popclip'
cask 'messenger'
cask 'skype'
cask 'skitch'
cask 'tweetbot'
cask 'virtualbox'
