
# tap 'repositories and their packages'

tap 'caskroom/cask'

tap 'caskroom/versions'

tap 'homebrew/boneyard'

tap 'homebrew/bundle'

tap 'homebrew/core'

tap 'rcmdnk/file'

# Other Homebrew 'packages'
brew 'autoconf'
brew 'automake'
brew 'brew-file'
brew 'ccat'
brew 'chromedriver'
brew 'cmake'
brew 'colordiff'
brew 'ctags'
brew 'dnsmasq'
brew 'figlet'
brew 'fortune'
brew 'git' 
brew 'go' 
brew 'gdbm'
brew 'hub' 
brew 'libevent' 
brew 'lua' 
brew 'maven' 
brew 'mysql'
brew 'openssl'
brew 'otto'
brew 'pkg-config'
brew 'pcre'
brew 'postgresql'
brew 'rbenv'
brew 'rbenv-gemset'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rsense'
brew 'ruby-build'
brew 'shellcheck'
brew 'sl'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'vim', args: ['with-lua']
brew 'wget'
brew 'zsh'
brew 'mas'

# cask 'applications'
cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'cheatsheet'
cask 'clipmenu'
cask 'coderunner'
cask 'cyberduck'
cask 'dash'
cask 'dropbox'
cask 'eclipse-java'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'hosts'
cask 'hyperswitch'
cask 'java'
cask 'karabiner'
cask 'pingendo'
cask 'scroll-reverser'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'

# App Store applications
mas 'FreeMan', id: 510934532
mas 'Kobito', id: 896624060
mas 'Pocket', id: 568494494

# Other commands
#gt k4h4shi/brewfile
